
#+DRAWERS: HIDDEN STATE
#+PROPERTY: header-args: lang           :varname value
#+PROPERTY: header-args:C++             :results output  :flags -std=c++17 -Wall --pedantic -Werror

***** Python Implementation

#+begin_src python :exports both :results output :tangle ~/dev/csit/sem3/dsa/sorting/selection_sort.py
  def sel_sort(array):
      N = len(array)
      for i in range(N):
          a_min = i
          for j in range(i+1, N):
              if array[j] < array[a_min]:
                  a_min = j
          exchange(a_min, i, array)
      return array

  def exchange(i, j, array):
      temp = array[i]
      array[i] = array[j]
      array[j] = temp

  print(sel_sort([5,4,3,4,0,5,2]))
#+end_src

#+RESULTS:
: [0, 2, 3, 4, 4, 5, 5]

***** C Implementation

#+begin_src C++ :main no :exports both :tangle ~/dev/csit/sem3/dsa/sorting/selection_sort.c :results output
  #include <stdio.h>

  void exchange(int i, int j, int array[]);

  void selection_sort(int array[], int N){
    for (int i=0; i<N; i++){
      int a_min = i;
      for(int j=i+1; j<N; j++)
        if (array[j] < array[a_min])
          a_min = j;
      exchange(i, a_min, array);
    }
  }

  void exchange(int i, int j, int array[]){
    int temp = array[i];
    array[i] = array[j];
    array[j] = temp;
  }

  int main(){
    int array[] = {5,3,0,4,2,5};
    int N = sizeof(array)/sizeof(int);
    selection_sort(array, N);
    for (int i=0; i<N; i++){
      printf("%d ", array[i]);
    }
  }
#+end_src

#+RESULTS:
: 0 2 3 4 5 5

***** Python Implementation

#+begin_src python :exports both :results output :tangle ~/dev/csit/sem3/dsa/sorting/insertion_sort.py
  def insertion_sort(array):
      N = len(array)
      for i in range(N):
          for j in range(i, 0, -1):
              if array[j] < array[j-1]:
                  exchange(j, j-1, array)
      return array

  def exchange(i, j, array):
      temp = array[i]
      array[i] = array[j]
      array[j] = temp

  print(insertion_sort([6,3,2,0,10,4,2]))
#+end_src

#+RESULTS:
: [0, 2, 2, 3, 4, 6, 10]

***** C Implementation

#+begin_src C++ :main no :exports both :tangle ~/dev/csit/sem3/dsa/sorting/insertion_sort.c :results output
  #include <stdio.h>

  void exchange(int i, int j, int array[]);

  void insertion_sort(int array[], int N){
    for (int i=0; i<N; i++)
      for(int j=i; j>0; j--)
        if (array[j] < array[j-1])
          exchange(j, j-1, array);
  }

  void exchange(int i, int j, int array[]){
    int temp = array[i];
    array[i] = array[j];
    array[j] = temp;
  }

  int main(){
    int array[] = {5,3,0,4,2,5};
    int N = sizeof(array)/sizeof(int);
    insertion_sort(array, N);
    for (int i=0; i<N; i++){
      printf("%d ", array[i]);
    }
  }
#+end_src

#+RESULTS:
: 0 2 3 4 5 5

***** Python Implementation
#+begin_src python :exports both :results output :tangle ~/dev/csit/sem3/dsa/sorting/shell_sort.py
  def shell_sort(array):
      N = len(array)
      # Compute the last increment
      h = 1
      while (h < N/3):
          h = 3*h + 1 # The 3x + 1 increment sequence

      while (h >= 1):
          for i in range(h, N):
              for j in range(i, 0, -h):
                  if j >= h and array[j] < array[j-h]:
                      array[j], array[j-h] = array[j-h], array[j]
          h = int(h/3)
      return array

  print(shell_sort([5,6,4,3,0,2,3]))
#+end_src

#+RESULTS:
: [0, 2, 3, 3, 4, 5, 6]

***** Top Down: Python Implementation

#+begin_src python :exports both :results output :tangle ~/dev/csit/sem3/dsa/sorting/merge_sort.py
  def merge(array, aux, mid, low, high):
      """Assumes array is sorted from 0 to mid and mid+1 to N"""
      for i in range(low, high+1): # Copy operation
          aux[i] = array[i]
      # i points to A's first, j to B's first and K to aux array's first
      i, j = low, mid+1
      for k in range(low, high+1):
          if i > mid:
              array[k] = aux[j]
              j += 1
              continue
          elif j > high:
              array[k] = aux[i]
              i+=1
              continue
          else:
              if aux[i] < aux[j]:
                  array[k] = aux[i]
                  i+=1
              else:
                  array[k] = aux[j]
                  j+=1

  def mergesort(array, aux, low, high):
      if low >= high:
          return
      mid = int(low + (high-low)/2)
      mergesort(array, aux, low, mid)
      mergesort(array,aux, mid+1, high)
      merge(array, aux, mid, low, high)

  def sort(array):
      aux = array[:]
      mergesort(array, aux, 0, len(array)-1)
      return array

  print(sort([4,2,0,5,2,9,1,0, 3]))
#+end_src

#+RESULTS:
: [0, 0, 1, 2, 2, 3, 4, 5, 9]

***** Top Down: Cpp Implementation

#+begin_src C++ :main no :exports both :tangle ~/dev/csit/sem3/dsa/sorting/merge_sort.c :results output
  #include <stdio.h>

  void merge(int array[], int aux[], int mid, int low, int high){
    // Takes an array, which is sorted from low to mid and mid+1 to high
    // This function merges these two halves together to get an ordered array

    // Copy operation
    for (int k=low; k<=high; k++)
      aux[k] = array[k];

    int i = low, j = mid+1;
    for (int k=low; k<=high; k++)
      if (i > mid) array[k] = aux[j++];
      else if (j > high) array[k] = aux[i++];
      else if (aux[i] < aux[j]) array[k] = aux[i++];
      else array[k] = aux[j++];
  }

  void mergesort(int array[], int aux[], int low, int high){
    if (low >= high) return;

    int mid = (int) low + (high - low) / 2;

    mergesort(array, aux, low, mid);
    mergesort(array, aux, mid+1, high);
    merge(array, aux, mid, low, high);
  }

  void sort(int array[], int N){
    int aux[N];
    mergesort(array, aux, 0, N-1);
  }

  int main(){
    int array[] = {1,2,3,9,0,2,5,3,0,6};
    int N = sizeof(array)/sizeof(int);

    sort(array, N);
    for (int i=0; i<N; i++){
      printf("%d ", array[i]);
    }
  }
#+end_src

#+RESULTS:
: 0 0 1 2 2 3 3 5 6 9

***** Python Implementation

#+begin_src python :exports both :results output :tangle ~/dev/csit/sem3/dsa/sorting/quick_sort.py
  import random

  def partition(array, lo, hi):
      par, i, j = array[lo], lo+1, hi
      while True:
          while array[i] <= par:
              if i == hi:
                  break
              i += 1

          while array[j] > par:
              j -= 1
              if j == lo:
                  break

          if j <= i:
              break
          array[j], array[i] = array[i], array[j]

      array[lo], array[j] = array[j], array[lo]
      return j

  def quicksort(array, lo, hi):
      if hi <= lo:
          return
      j = partition(array, lo, hi)
      quicksort(array, lo, j-1)
      quicksort(array, j+1, hi)

  def sort(array):
      random.shuffle(array)
      quicksort(array, 0, len(array)-1)
      return array

  print(sort([5,4,3,0,2,7,9,1,5]))
  print(sort([0,2,1]))
  print(sort([3,1,2]))
  print(sort([3,1]))
  print(sort([1,3]))
#+end_src

#+RESULTS:
: [0, 1, 2, 3, 4, 5, 5, 7, 9]
: [0, 1, 2]
: [1, 2, 3]
: [1, 3]
: [1, 3]
: [0, 2]

***** C Implementation
#+begin_src C++ :main no :exports both :results output :tangle ~/dev/csit/sem3/dsa/sorting/quick_sort.c
  #include <stdio.h>

  void exchg(int array[], int i, int j);

  int partition(int array[], int lo, int hi){
    int i = lo+1, j = hi, par=array[lo];
    while(1){
        while(array[i] <= par){
          i++;
          if (i == hi) { break; }
       }

        while(array[j] > par){
          j--;
          if (j == lo){ break;}
       }

        if (j <= i) { break;}
        exchg(array, i, j);
    }
    exchg(array, lo, j);
    return j;
  }

  void quicksort(int array[], int lo, int hi){
    if (hi <= lo)
      return;
    int j = partition(array, lo, hi);
    quicksort(array, lo, j-1);
    quicksort(array, j+1, hi);
   }

  void sort(int array[], int N){
     // TODO shuffle array in c
     quicksort(array, 0, N-1);
  }

  void exchg(int array[], int i, int j){
        int temp = array[i];
        array[i] = array[j];
        array[j] = temp;
  }

  int main(){
    int array[] = {3, 0};
    int N = sizeof(array)/sizeof(int);
    sort(array, N);

    for(int i=0; i<N; i++){
      printf("%d ", array[i]);
    }
    return 0;
  }
#+end_src

#+RESULTS:
: 0 3

